Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/rights_of_residence_in_ireland/residence_rights_eu_national.html.txt.tmx
Source language: en
Languages: ga

source: Residence rights of EEA nationals in Ireland
ga: Cearta cónaithe in Éirinn do náisiúnaigh LEE

source: If you are a national of the European Economic Area (EEA) or of Switzerland, you have the right to stay in Ireland, and your family members have the right to stay here also
ga: Más náisiúnach den Limistéar Eorpach Eacnamaíoch (LEE) nó den Eilvéis, tá an ceart agat fanacht in Éirinn agus tá an ceart céanna ag baill do theaghlaigh

source: There are some limits to this right, however
ga: Tá srianta áirithe leis an gceart seo, áfach

source: You can stay in Ireland for up to 3 months without restriction
ga: Is féidir leat fanacht in Éirinn ar feadh suas go trí mhí gan srian

source: If you plan to stay more than 3 months, you must either:
ga: Má tá sé i gceist agat fanacht níos faide ná trí mhí, ní mór duit:

source: • Be engaged in economic activity (employed or self employed) or
ga: • A bheith páirteach i ngníomhaíocht eacnamaíoch (fostaithe nó féinfhostaithe) nó

source: • Have sufficient resources and sickness insurance to ensure that you do not become a burden on the social services of Ireland or
ga: • Dóthain acmhainní a bheith agat, chomh maith le hárachas sláinte chun a chinntiú nach mbeidh tú i d'ualach ar sheirbhísí sóisialta na hÉireann

source: • Be enrolled as a student or vocational trainee or
ga: • A bheith cláraithe mar mhac léinn nó mar ghairmoiliúnaí nó

source: • Be a family member of a EU citizen in one of the previous categories
ga: • A bheith i do bhall teaghlaigh de shaoránach an LEE atá clúdaithe faoi cheann de na catagóirí thuas

source: When you come to Ireland you do not need to register with the local immigration officer and you do not need a residence card to live here
ga: Nuair a thagann tú in Éirinn, ní gá duit clárú leis an oifigeach inimirce áitiúil

source: If you wish to have a record of your residence in Ireland you can register with your embassy of your country in Ireland
ga: Más mian leat taifead de do chónaí in Éirinn a bheith agat, is féidir leat leis an ambasáid de do thír féin a chlárú

source: UK citizens: People who are citizens of the United Kingdom (UK) are entitled to live in Ireland without any conditions or restrictions
ga: Saoránaigh RA: Más daoine saoránaigh na Ríochta Aontaithe (RA) iad, tá siad i dteideal bheith ina gcónaí in Éirinn gan aon choinníollacha nó srianta

source: Seeking employment in Ireland
ga: Fostaíocht a chuardach in Éirinn

source: If you are an EEA national, you can stay in Ireland if you are unemployed and looking for work
ga: Más náisiúnach den LEE thú is féidir leat fanacht in Éirinn má tá tú dífhostaithe agus ag cuardach oibre

source: You can transfer your unemployment benefit from your country of origin and it will be paid to you in Ireland for up to 3 months (can be up to 6 months in some cases)
ga: Is féidir leat do shochar dífhostaíochta a aistriú ó do thír dhúchais agus íocfar duit é in Éirinn le haghaidh suas go 3 mhí

source: After that period, you may qualify for Jobseeker's Allowance if you satisfy the conditions, which include an Habitual Residence Condition
ga: Tar éis na tréimhse sin, d'fhéadfá a bheith i dteideal Liúntas Cuardaitheora Poist a fháil má shásaíonn tú na coinníollacha, ina measc Coinníoll an Ghnáthchónaithe

source: Residence rights for your family
ga: Cearta cónaithe do theaghlaigh

source: If you are an EEA or Swiss national, your family, whatever their nationality, also have the right to live with you in Ireland
ga: Má tá tú mar náisiúnach de bhallstát an AE, nó náisiúnach na hÍoslainne, Lichtinstéin, na hIorua nó na hEilvéise, tá sé de cheart ag do theaghlach, cibé náisiúntacht atá acu, a bheith in gcónaí leat in Éirinn

source: Your qualifying family member is defined as your spouse, civil partner, children under 21 and other children who are dependent on you and their spouses or civil partners, your parents and your spouse or civil partner's parents, if they are also dependent on you
ga: Tá do bhall theaghlach cáilithe sainmhínithe mar do chéile, pháirtnéir sibhialta, leanaí níos óige ná 21 agus leanaí eile atá ag brath ort chomh maith lena gcuid céile nó bpáirtnéirí sibhialta, do thuismitheoirí agus tuismitheoirí do chéile nó pháirtnéir sibhialta, má tá siad ag brath ort chomh maith

source: The European Communities (Free Movement of Persons) Regulations 2O15 transpose EU Directive 2004/38/EC (pdf) into Irish law
ga: Trasuíonn Rialacháin 2015 (Saorghluaiseacht Daoine) na gComhphobal Eorpach an Treoir AE 2004/38/EC (pdf) i dlí na hÉireann

source: The Directive allows for a wider definition of family members
ga: Ceadaíonn an Treoir sainmhíniú níos leithne maidir le duine muinteartha

source: The wider definition of family member means that the host member state must facilitate the entry and residence of other family members who do not have an absolute right to move but who are dependent on you or whose health is such that they require care by you
ga: Ciallaíonn an sainmhíniú níos leithne go gcaithfidh an ballstát óstach iontráil agus cónaí dhaoine muinteartha eile a éascú, na daoine siúd nach bhfuil ceart glan acu bogadh ach atá ag brath ort nó tá a sláinte i riocht a chiallaíonn go bhfuil cúram uait riachtanach

source: Member states must also facilitate the entry and residence of a partner with whom you have a durable relationship
ga: Caithfidh ballstáit iontráil agus cónaí pháirtithe lena bhfuil caidreamh buan agat a éascú chomh maith

source: These other dependants or partners who are not qualifying family members are permitted family members
ga: Mura na cleithiúnaithe eile nó pháirtithe seo baill teaghlaigh cáilithe iad, is baill teaghlaigh ceadaithe iad

source: You can find more information about these EU Treaty Rights on the Irish Naturalisation and Immigration Service website
ga: Tá tuilleadh eolais faoi na Cearta Conartha AE ar fáil ar shuíomh na Seirbhíse Eadóirseachta agus Inimirce na hÉireann

source: The Immigrant Council of Ireland has published a leaflet on family reunification for family members of EU citizens (pdf)
ga: D’fhoilsigh an Chomhairle Inimirce na hÉireann bileog maidir le hathaontú teaghlaigh do bhall teaghlaigh saoránach LEE (pdf)

source: If your family members are not nationals of the EEA, they will need to apply for residence cards and may also need entry visas
ga: Mura bhfuil do mhuintir mar náisiúnaigh an AE nó an LEE, beidh orthu iarratas a dhéanamh ar chártaí cónaithe agus d'fhéadfadh go mbeidh víosaí iontrála de dhíth orthu chomh maith

source: There is no fee for the residence card
ga: Níl táille ar bith ar chárta cónaithe

source: They will also need to register with immigration and receive an Immigration Certificate of Registration (often called a GNIB card)
ga: Chomh maith leis sin beidh orthu clárú le inimirce agus Teastas Inimirce de Chlárú (glaotar cárta BNGSI air de ghnáth) a fháil

source: As dependants of an EEA citizen, they will be exempt from the fee for this certificate
ga: Mar chleithiúnaigh de shaoránach LEE, beidh siad díomhaithe ó tháille don teastas seo

source: Limitations on the right of residence
ga: Srianta ar an gceart cónaithe

source: You or a family member may be asked to leave the State if you act in such a way as to be a danger to public order or security
ga: B'fhéidir go n-iarrfar ort nó ar bhall do theaghlaigh an Stát a fhágáil má iompraíonn tú tú féin ar bhealach a d'fhéadfadh a bheith ina chontúirt d'ord nó do shlándáil phoiblí

source: Having a criminal record is not, in itself, grounds to be asked to leave
ga: Ní fáth ann féin é taifead coiriúil a bheith agat chun go n-iarrfar ort an tír a fhágáil

source: You may also be asked to leave on public health grounds
ga: B'fhéidir go n-iarrfar ort an tír a fhágáil ar fhorais shláinte phoiblí

source: You must be told reasons for the decision and given time to prepare an appeal
ga: Ní mór go inseofar duit fáthanna an chinnidh agus go dtabharfar am duit achomharc a ullmhú

source: These Regulations also introduce a new right of permanent residence for EEA nationals and their family members after a five-year period of uninterrupted legal residence in the State
ga: Tugann na Rialacháin isteach freisin ceart nua maidir le cónaí buan do náisiúnaigh an AE agus a mbaill teaghlaigh tar éis tréimhse cúig bliana de chónaí dlíthiúil gan briseadh sa Stát

source: Requirement to produce identity documents
ga: Riachtanas doiciméid aitheantais a thabhairt ar aird

source: Section 34 of the Civil Law (Miscellaneous Provisions) Act 2011 provides that non-EEA nationals arriving in the State must present a passport or equivalent document when asked for it by an immigration officer
ga: Soláthraíonn an tAcht um an Dlí Sibhialta (Forálacha Ilghnéitheacha) 2011 alt 34 gur mór do náisiúnaigh neamh-LEE atá ag teacht isteach sa Stát, pas nó doiciméad coibhéiseach a thabhairt nuair a iarrann oifigeach imirce orthu

source: (Previously, it was not specifically stated that they had to present it.)
ga: (Roimhe seo, ní raibh sé sonraithe gur mór dóibh é a thabhairt.)

source: It also requires non-EEA nationals who are present in the State to provide such a document or a registration certificate on demand to the Minister, an immigration officer or a Garda, if asked to do so to prove that they comply with their permission to remain in the State
ga: Éilítear ar náisiúnaigh neamh-LEE atá láithreach sa Stát doiciméad nó teastas chlárú a thabhairt don Aire, d’oifigeach imirce nó do Gharda, má iarrtar orthu, chun cruthú um chomhlíonadh ceada fanacht sa Stát

source: This requirement does not apply to people under 16 years of age, but it does now apply to non-EEA nationals who were born in Ireland
ga: Ní bhaineann an riachtanas seo le daoine faoi bhun 16 bliana d’aois ach baineann sé anois le náisiúnaigh neamh-LEE a rugadh in Éirinn

source: Section 34 does not apply to people who are exercising EU Treaty Rights of free movement
ga: Ní bhaineann Alt 34 le daoine a fheidhmíonn an ceart atá acu chun saorghluaiseachta

source: However, anyone seeking to enter or live in the State on the basis of being an EEA national or a dependant of an EEA national is still required to provide satisfactory evidence of identity and nationality to establish that basis
ga: Áfach, má iarrann aon duine cead teacht isteach nó cónaí in Éirinn ar bhonn náisiúntacht LEE nó cleithiúnaí náisiúnaigh LEE, ní mór dóibh leorfhianaise aitheantais agus náisiúntachta a sholáthar chun an bonn seo a fhaigh amach

source: Parents of Irish citizen children
ga: Tuismitheoirí de leanaí ar shaoránaigh Éireannacha iad

source: On 8 March 2011 the European Court of Justice (ECJ) ruled in the Zambrano case C 34/09, that an EU member state may not refuse the non-EEA parents of a dependent child who is a citizen of, and resident in, an EU member state the right to live and work in that member state
ga: Ar 8 Márta 2011, rialaigh Cúirt Bhreithiúnais an Aontais Eorpaigh (ECJ) ar an gcás Zambrano C 34/09, nach féidir le ballstát AE diúltiú do thuismitheoirí neamh-AE de leanbh cleithiúnach ar saoránach é agus ar cónaitheach é i mballstát AE ceart maireachtála agus oibre sa bhallstát sin

source: Non-EEA parents who meet the Zambrano criteria may be given permission to live and work in Ireland without the requirement for an employment permit or business permission
ga: Má chomhlíonann siad critéir Zambrano, d’fhéadfaí go dtabharfaí cead do na tuismitheoirí neamh-LEE cónaí agus oibriú in Éirinn gan cheanglais cead fostaíochta nó cead gnó

source: There is no charge for a residence card for a non-EEA national family member, for a permanent residence certificate or for a permanent residence card
ga: Níl táille ar bith ar chárta cónaithe, ar theastas buanchónaithe nó ar chárta buanchónaithe do dhaoine muinteartha neamh-LEE

source: Non-EEA national family members who receive a residence permit under EU Directive 38/04 are exempt from the general fee for the Immigration Certificate of Registration - GNIB card
ga: Tá daoine muinteartha neamh-LEE a fhaigheann cead cónaithe faoin Treoir AE 2004/38 díolmhaithe ón táille ghinearálta de €15 don Teastas Inimirce de Chlárú - cárta BNGSI

source: For a visa for a non-EEA national family member, you must apply for a visa online
ga: Maidir le víosa do dhuine muinteartha atá ina náisiúnach neamh-LEE: Caithfidh tú cur isteach ar an víosa ar-líne

source: For a residence card for a non-EEA national qualifying family member apply using the application form EU 1 (pdf) and explanatory leaflet (pdf)
ga: Maidir le cárta cónaithe do do bhall teaghlaigh náisiúnach neamh-LEE cáilithe, déan iarratas trí úsáid na foirme iarratais EU 1 (pdf) agus na bileoige mhínitheach (pdf)

source: For a residence card for a non-EEA national permitted family member apply using the application form EU 1A (pdf) and explanatory leaflet (pdf)
ga: Maidir le cárta cónaithe do do bhall teaghlaigh náisiúnach neamh-LEE cáilithe, déan iarratas trí úsáid na foirme iarratais EU 1A (pdf) agus na bileoige mhínitheach (pdf)

source: For a permanent residence certificate for an EU citizen who has lived in the State for 5 years apply using the application form EU 2 (pdf) and explanatory leaflet (pdf)
ga: Maidir le teastas buanchónaithe do shaoránach de chuid an AE atá ina c(h)ónaí sa Stát le cúig bliana déan iarratas trí úsáid na foirme iarratais EU 2 (pdf) agus na bileoige mhínitheach (pdf)

source: For a permanent residence card for a family member who has lived in the State for 5 years apply using the application form EU 3 (pdf) and explanatory leaflet (pdf)
ga: Maidir le teastas buanchónaithe do dhuine muinteartha atá ina c(h)ónaí sa Stát le 5 bliana déan iarratas trí úsáid na foirme iarratais EU 3 (pdf) agus na bileoige mhínitheach (pdf)

source: Completed application forms should be returned to the EU Treaty Rights Section of the Irish Naturalisation and Immigration Service (INIS)
ga: Ba chóir foirmí iarratais comhlánaithe a bheith curtha thar n-ais chuig an Rannán um Chearta Chonradh AE de chuid Sheirbhís Eadóirseachta agus Inimirce na hÉireann (INIS)

source: If your EU 1, EU 2 or EU 3 application has been refused you can request a review of this decision using form EU 4 (pdf) and explanatory leaflet (pdf)
ga: Má tá d'iarratas EU 1, EU 2 nó EU 3 diúltaithe, is féidir iarratas ar athbhreathnú an cinneadh seo tríd an fhoirm EU 4 (pdf) agus an bhileog mhínitheach (pdf) a úsáid

source: Following divorce or annulment or the death or departure of the EU citizen, a holder of an EU1 residence card can apply to retain a residence card using application form EU5 (pdf) and explanatory leaflet (pdf)
ga: I ndiaidh colscaradh nó neamhniú nó bás nó imeacht an saoránach AE, is féidir sealbhóir cárta cónaithe EU 1 iarratas a dhéanamh ar chárta cónaithe a choinneáil trí úsáid na foirme iarratais EU 5 (pdf) agus na bileoige mhínitheach (pdf)

source: For an Immigration Certificate of Registration:
ga: Maidir le Teastas Inimirce de Chlárú:

source: Apply to your local immigration registration office
ga: Déan iarratas ar d'oifig cláraithe inimirce áitiúil

source: In Dublin this is the Burgh Quay Registration Office
ga: I mBaile Átha Cliath is é seo Oifig Chlárúcháin Cé an Bhúrcaigh

source: Since 15 September 2016, you must book an appointment online to visit it
ga: Ó 15 Meán Fómhair 2016, caithfidh tú coinne a scríobh isteach ar líne chun cuairt a thabhairt air

source: Outside Dublin this is at your regional registration office or local Garda District Headquarters
ga: Lasmuigh de Bhaile Átha Cliath tá sé seo ag d'oifig chlárúcháin régiúnach nó do Cheanncheathrú Dúiche áitiúil de chuid an Gharda Síochána
